{
    "crew_type": "custom_insights",
    "description": "Template for custom insights assessment - perform SWOT analysis on documents with client context",
    
    "insight_definition": {
      "description": "Meaningful observations about strengths, weaknesses, opportunities, and threats derived from the discussion",
      "categories": {
        "strength": "Positive internal factors or capabilities mentioned in the discussion",
        "weakness": "Internal limitations, challenges, or areas for improvement",
        "opportunity": "External factors that could benefit the client or situation",
        "threat": "External challenges or risks that could negatively impact the client"
      },
      "impact_levels": {
        "high": "Major impact on business outcomes or strategy",
        "medium": "Moderate impact requiring attention",
        "low": "Minor impact worth noting"
      }
    },
    
    "workflow": {
      "enabled_stages": ["document_analysis", "chunking", "planning", "extraction", "aggregation", "evaluation", "formatting", "review"],
      "agent_roles": {
        "planner": {
          "description": "Plans the SWOT analysis approach with client context in mind",
          "primary_task": "Create tailored instructions for identifying SWOT elements relevant to client context",
          "instructions": "Study the document and client context to identify the most relevant insights. Create specific extraction and evaluation instructions that focus on SWOT elements particularly relevant to this client's situation."
        "evaluator": {
          "description": "Assesses impact and relevance of SWOT elements",
          "primary_task": "Evaluate the impact and strategic importance of each insight given client context",
          "evaluation_criteria": [
            "Relevance to client context",
            "Strategic importance",
            "Actionability",
            "Time sensitivity",
            "Magnitude of potential impact"
          ],
          "instructions": "Evaluate each insight for its impact and strategic importance given the client context. Consider how actionable the insight is, its time sensitivity, and the magnitude of its potential impact. Prioritize insights that are most relevant to the client's specific situation and goals."
        },
        "formatter": {
          "description": "Creates a structured SWOT analysis report",
          "primary_task": "Format insights into a clear SWOT analysis organized by category and impact",
          "instructions": "Create a well-structured SWOT analysis report that clearly presents strengths, weaknesses, opportunities, and threats. Organize by impact level within each category. Include an executive summary that highlights the most important insights across categories."
        },
        "reviewer": {
          "description": "Ensures the SWOT analysis is balanced, insightful, and relevant to client context",
          "primary_task": "Verify insights are properly categorized and provide strategic value",
          "instructions": "Review the SWOT analysis for balance, accuracy, and strategic relevance. Ensure each insight is properly categorized and provides value. Check that the analysis is aligned with the client context and captures the most important insights from the discussion."
        }
      },
        "extractor": {
          "description": "Identifies SWOT elements from document chunks",
          "primary_task": "Extract statements that indicate strengths, weaknesses, opportunities, or threats",
          "output_schema": {
            "type": "SWOT category (strength, weakness, opportunity, threat)",
            "description": "Description of the insight",
            "impact": "Initial impact assessment",
            "confidence": "Confidence level in this assessment",
            "context": "Relevant context from the document"
          },
          "instructions": "Extract statements that indicate strengths, weaknesses, opportunities, or threats. Use the client context to guide your identification - what might be a strength for one organization could be a weakness for another. Look for explicit statements as well as implied insights."
        },
        "aggregator": {
          "description": "Combines and organizes SWOT elements",
          "primary_task": "Consolidate similar insights and organize by SWOT category",
          "instructions": "Combine similar insights while preserving nuance and detail. Organize insights into proper SWOT categories. Ensure insights are aligned with the client context provided."
        },